newdigate/teensy-cores/imxrt1176/startup.c
/* Teensyduino Core Library
 * http://www.pjrc.com/teensy/
 * Copyright (c) 2019 PJRC.COM, LLC.
 *
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files (the
 * "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to
 * permit persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * 1. The above copyright notice and this permission notice shall be
 * included in all copies or substantial portions of the Software.
 *
 * 2. If the Software is incorporated into a build system that allows
 * selection among a list of target devices, then similar target
 * devices manufactured by PJRC.COM must be included in the list of
 * target devices and selectable in the same manner.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
 * NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
 * BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
 * ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

/* ============================================================================
 * MIMXRT1170-EVKB (i.MX RT1176, Cortex-M7) — minimal Phase-0 ResetHandler.
 *
 * This is the *first* end-to-end boot bring-up for the EVKB port. Its only job
 * is to get from the QEMU/silicon FlexSPI boot-ROM hand-off to main():
 *   - boot-ROM validates the FCB/IVT (see bootdata.c) and branches to the
 *     entry it reads from IVT.entry (== ResetHandler); it also loads the
 *     initial MSP + VTOR from the Cortex-M vector table at flash base + 0x2000.
 *   - the linker (imxrt1176.ld) places .startup first in .text.code at
 *     ORIGIN(FLASH)+0x2000 == 0x30002000, so the vector table below lands
 *     exactly where the boot-ROM expects it.
 *
 * It relies on the clocks the boot-ROM already set up (real CCM config is a
 * later task), does the .text-to-ITCM / .data copy and .bss zero that the
 * linker LMA->VMA layout requires, enables the FPU, runs C++ constructors,
 * and calls main().
 *
 * ResetHandler configures the FlexRAM ITCM/DTCM bank split (GPR17/16/14) before
 * touching the stack, since _estack now lives at DTCM-top: required on both QEMU
 * (which resizes the TCM RAMBlock on the GPR16/17 writes) and silicon (the
 * BootROM-default DTCM is too small to back DTCM-top). Other RT1062-specific
 * bring-up (DCDC, USB PHY, temp sensor, external RAM, MPU/cache, printf debug)
 * remains removed, to be re-added in proper RT1176 form in later phases.
 * ========================================================================== */

#include <stdint.h>
#include "imxrt1176.h"   /* CCM clock-root, ANADIG PLL/OSC, SysTick, DWT regs */
#include "core_pins.h"   /* NVIC_NUM_INTERRUPTS, IRQ_NUMBER_t, _VectorsRam decl */
#include "smalloc.h"     /* struct smalloc_pool (for the extmem_smalloc_pool definition) */

/* ---- symbols exported by imxrt1176.ld ---- */
extern uint32_t _stext;       /* ITCM .text.itcm VMA start                  */
extern uint32_t _etext;       /* ITCM .text.itcm VMA end (incl .ARM.exidx)  */
extern uint32_t _stextload;   /* ITCM .text.itcm LMA (in FLASH)             */
extern uint32_t _sdata;       /* DTCM .data VMA start                       */
extern uint32_t _edata;       /* DTCM .data VMA end                         */
extern uint32_t _sdataload;   /* DTCM .data LMA (in FLASH)                  */
extern uint32_t _sbss;        /* DTCM .bss VMA start                        */
extern uint32_t _ebss;        /* DTCM .bss VMA end                          */
extern uint32_t _sbss_dma;    /* OCRAM .dmabuffers (DMAMEM) start           */
extern uint32_t _ebss_dma;    /* OCRAM .dmabuffers (DMAMEM) end             */
extern uint32_t _extram_start; /* .bss.extram (EXTMEM statics) start (imxrt1176.ld) */
extern uint32_t _extram_end;   /* .bss.extram end                                   */
extern uint32_t _estack;      /* top of stack (DTCM)                        */
extern uint32_t _flexram_bank_config;   /* linker absolute symbol; its address IS the value */

extern int main(void);
extern void __libc_init_array(void); /* C++ static constructors            */
extern void semc_sdram_init(void);   /* SEMC 64 MB SDRAM @ 0x80000000 (semc.c) */

/* Core clock. Task 9 brings the ARM PLL up to 996 MHz and routes it to the M7
 * CLOCK_ROOT; set_arm_clock_rt1176() re-affirms this at runtime. Defined here as
 * the single source of truth so timing code (delay.c, Task 10) links against it. */
volatile uint32_t SystemCoreClock = 996000000u;

/* Millisecond tick counter incremented by systick_isr(). DEFINED in delay.c
 * (Task 10); a weak placeholder here lets Task 9 link/run standalone and is
 * silently overridden by delay.c's strong definition once it lands. */
__attribute__((weak)) volatile uint32_t systick_millis_count = 0;

static void memory_copy(uint32_t *dest, const uint32_t *src, uint32_t *dest_end);
static void memory_clear(uint32_t *dest, uint32_t *dest_end);

void ResetHandler(void);
void set_arm_clock_rt1176(void);
void systick_init(void);
void systick_isr(void);
static void fault_isr(void);
static void unused_isr(void);

/* ----------------------------------------------------------------------------
 * Cortex-M vector table (flash, at 0x30002000 via .startup placement).
 *
 * entry[0] = initial MSP (_estack), entry[1] = ResetHandler.
 * The 16 architectural exceptions are populated; everything else (a small
 * NVIC tail sufficient for the boot-ROM's MSP/VTOR fetch) routes to
 * unused_isr. Phase-0 EVKB needs no peripheral ISRs; SysTick is added in
 * Task 9. VTOR is repointed here in ResetHandler.
 * -------------------------------------------------------------------------- */
__attribute__((section(".vectors"), used))
void (* const _VectorsFlash[16 + 16])(void) =
{
	(void (*)(void))((uint32_t)&_estack), /*  0 Initial stack pointer        */
	ResetHandler,                         /*  1 Reset                        */
	fault_isr,                            /*  2 NMI                          */
	fault_isr,                            /*  3 HardFault                    */
	fault_isr,                            /*  4 MemManage                    */
	fault_isr,                            /*  5 BusFault                     */
	fault_isr,                            /*  6 UsageFault                   */
	unused_isr,                           /*  7 reserved                     */
	unused_isr,                           /*  8 reserved                     */
	unused_isr,                           /*  9 reserved                     */
	unused_isr,                           /* 10 reserved                     */
	unused_isr,                           /* 11 SVCall                       */
	unused_isr,                           /* 12 DebugMonitor                 */
	unused_isr,                           /* 13 reserved                     */
	unused_isr,                           /* 14 PendSV                       */
	systick_isr,                          /* 15 SysTick (Task 9)             */
	/* small NVIC tail — Phase 0 uses no peripheral interrupts */
	unused_isr, unused_isr, unused_isr, unused_isr,
	unused_isr, unused_isr, unused_isr, unused_isr,
	unused_isr, unused_isr, unused_isr, unused_isr,
	unused_isr, unused_isr, unused_isr, unused_isr,
};

/* ----------------------------------------------------------------------------
 * RAM vector table (DTCM, .vectorsram NOLOAD region). Populated in ResetHandler
 * by copying the 16 architectural + 16 flash NVIC-tail entries and defaulting
 * the remaining external IRQs to unused_isr; VTOR is then repointed here so
 * attachInterruptVector() can install ISRs at run time.
 * -------------------------------------------------------------------------- */
__attribute__((section(".vectorsram"), used, aligned(1024)))
void (* volatile _VectorsRam[16 + NVIC_NUM_INTERRUPTS])(void);

uint8_t external_psram_size = 0;        /* reported external RAM size in MB (fixed 64) */
struct smalloc_pool extmem_smalloc_pool; /* the EXTMEM heap pool (declared extern in smalloc.h) */

/* ----------------------------------------------------------------------------
 * ResetHandler — boot-ROM entry. Bring RAM up and reach main().
 * -------------------------------------------------------------------------- */
__attribute__((section(".startup"), naked))
void ResetHandler(void)
{
	/* Dual-core hygiene: this is an M7-only image, but the BootROM also releases
	 * the CM4.  With no CM4 firmware it fetches garbage and locks up, which by
	 * default (SRC_SRMR.M4LOCKUP_RESET_MODE=0b00) resets the WHOLE SoC
	 * (SRC_SRSR.M4_LOCKUP_M7, bit12) -> intermittent full boot resets.  Tell SRC
	 * not to reset on a CM4 lockup or CM4 reset-request.  Plain register store,
	 * no stack; must precede anything that a stray CM4 reset would disturb.
	 * (Verified on EVKB: SRMR reads 0x3CC0, SRSR stays clean.) */
	SRC_SRMR |= (0x3u << 6) | (0x3u << 10);   /* M4LOCKUP + M4REQ reset mode = 0b11 (do not reset) */

