newdigate/teensy-cores/imxrt1176/startup.c
	/* Configure the FlexRAM ITCM/DTCM bank split BEFORE using the stack: the
	 * BootROM-default split does not back DTCM-top, so this must run first.
	 * ResetHandler is naked and these are plain register stores (no stack use).
	 * RT1176 splits the 16-bank config across GPR17 (low 8 banks) and GPR18
	 * (high 8 banks); GPR16.FLEXRAM_BANK_CFG_SEL (bit2) selects it. Unlike RT1062
	 * there are no GPR14 TCM-size or GPR16 INIT_ITCM/DTCM_EN fields to write. */
	IOMUXC_GPR_GPR17 = ((uint32_t)&_flexram_bank_config) & 0xFFFFu;         /* banks 0-7  */
	IOMUXC_GPR_GPR18 = (((uint32_t)&_flexram_bank_config) >> 16) & 0xFFFFu; /* banks 8-15 */
	IOMUXC_GPR_GPR16 |= 0x4u;                                               /* FLEXRAM_BANK_CFG_SEL */
	__asm__ volatile("dsb":::"memory"); __asm__ volatile("isb":::"memory");

	/* The boot-ROM already loaded MSP from the vector table, but set it
	 * again explicitly so we are independent of how we were entered. */
	__asm__ volatile("mov sp, %0" : : "r" ((uint32_t)&_estack) : "memory");

	/* enable the FPU (CP10/CP11 full access) */
	*(volatile uint32_t *)0xE000ED88 |= (0xF << 20);
	__asm__ volatile("dsb":::"memory");
	__asm__ volatile("isb":::"memory");

	/* copy fast code from flash LMA to ITCM, and .data from flash to DTCM */
	memory_copy(&_stext, &_stextload, &_etext);
	memory_copy(&_sdata, &_sdataload, &_edata);

	/* zero .bss */
	memory_clear(&_sbss, &_ebss);

	/* zero .dmabuffers (DMAMEM / OCRAM).  Unlike Teensy, where OCRAM .bss is
	 * zeroed for free, ours is a separate NOLOAD section -- so DMAMEM-placed
	 * objects (e.g. USBHost driver globals whose ctors don't set every member)
	 * would hold power-on garbage.  NOLOAD means nothing can depend on non-zero
	 * contents, so clearing is strictly safe; runs before __libc_init_array so
	 * C++ constructors see zeroed members. */
	memory_clear(&_sbss_dma, &_ebss_dma);

	/* Build the RAM vector table: copy the 16 architectural + 16 flash NVIC-tail
	 * entries, default the remaining external IRQs to unused_isr, then repoint
	 * VTOR at RAM so attachInterruptVector() can install ISRs at run time.
	 * (_VectorsFlash is [16 + 16]; only indices < 32 are read from it.) */
	for (unsigned i = 0; i < 16 + NVIC_NUM_INTERRUPTS; i++) {
		_VectorsRam[i] = (i < 16 + 16) ? _VectorsFlash[i] : unused_isr;
	}
	__asm__ volatile("dsb":::"memory");
	SCB_VTOR = (uint32_t)_VectorsRam;
	__asm__ volatile("dsb":::"memory"); __asm__ volatile("isb":::"memory");

	/* Raise the CM7 core supply (DCDC VDD1P0) to 1.15 V OverDrive BEFORE boosting to
	 * 996 MHz.  Mirrors the SDK BOARD_BootClockRUN: put the DCDC in CCM mode, clear
	 * REG3.VDD1P0CTRL_DISABLE_STEP (a bare CTRL1 write with stepping disabled does
	 * NOTHING - why the first attempt failed), set the buck target, then wait for
	 * REG0.STS_DC_OK.  DCDC @ 0x40CA8000: CTRL1@+4, REG0@+8, REG2@+0x10, REG3@+0x14.
	 * VDD1P0CTRL_TRG[12:8]: 16=1.0 V, +1 step=+25 mV, 22=1.15 V.  Waits are bounded. */
	{
		volatile uint32_t *DCDC_CTRL1 = (volatile uint32_t *)0x40CA8004u;
		volatile uint32_t *DCDC_REG0  = (volatile uint32_t *)0x40CA8008u;
		volatile uint32_t *DCDC_REG2  = (volatile uint32_t *)0x40CA8010u;
		volatile uint32_t *DCDC_REG3  = (volatile uint32_t *)0x40CA8014u;
		uint32_t g;
		*DCDC_REG0 = (*DCDC_REG0 & ~0x04000000u) | 0x1u;         /* CCM: -PWD_CMP_OFFSET +PWD_ZCD */
		*DCDC_REG2 = (*DCDC_REG2 & ~0x00000E00u) | (3u << 9);    /* LOOPCTRL_EN_RCSCALE = 3       */
		*DCDC_REG3 &= ~0x20000000u;                              /* enable VDD1P0 stepping        */
		*DCDC_CTRL1 = (*DCDC_CTRL1 & ~0x1F00u) | (22u << 8);     /* VDD1P0CTRL_TRG = 22 (1.15 V)  */
		for (g = 0; g < 200000u && !(*DCDC_REG0 & 0x80000000u); g++) { }  /* wait STS_DC_OK */
		__asm__ volatile("dsb":::"memory");
	}

	/* RT1176 CCM bring-up: ARM PLL -> 996 MHz on the M7 core CLOCK_ROOT */
	set_arm_clock_rt1176();

	/* 1 kHz SysTick + DWT cycle counter (must follow the clock init so the
	 * reload value matches the now-996 MHz core) */
	systick_init();

	/* SNVS real-time clock (battery-backed, always-on domain). Port of teensy4
	 * startup.c: if the LP secure RTC isn't already running (cold boot / VBAT
	 * lost), seed it with a default epoch (Jan 1 2019, 00:00:00 UTC); if it IS
	 * running (warm reset / coin-cell held), leave it untouched so persisted time
	 * survives. Then start + sync the HP RTC from the LP secure counter
	 * (HPCR RTC_EN|HP_TS) so rtc_get() reads live, persisted time. MMIO-only, not
	 * a memory-pool setup, so the extmem boot-path reset-loop hazard does NOT
	 * apply here. If HW reset-loops anyway, move this to a lazy first-use guard in
	 * rtc.c (Approach B). */
	if (!(SNVS_LPCR & SNVS_LPCR_SRTC_ENV)) {
		SNVS_LPSRTCLR = 1546300800u << 15;   /* Jan 1 2019 */
		SNVS_LPSRTCMR = 1546300800u >> 17;
		SNVS_LPCR |= SNVS_LPCR_SRTC_ENV;
	}
	SNVS_HPCR |= SNVS_HPCR_RTC_EN | SNVS_HPCR_HP_TS;

	/* Bring up the SEMC 64 MB SDRAM at 0x80000000 so the .externalram (EXTMEM)
	 * region is live before C++ constructors or any external-RAM access. Runs
	 * after the clocks are up and before __libc_init_array(). */
	semc_sdram_init();

	/* Zero the static EXTMEM globals (.bss.extram — SDRAM is now live) so C++ static
	 * constructors see zeroed EXTMEM members. D-cache is off in this core, so
	 * memory_clear writes reach SDRAM directly (teensy4 needs a dcache flush here; we
	 * do not). report the fixed 64 MB. The extmem_malloc *pool* is NOT handed to
	 * smalloc from here: a sm_set_pool() call in this .startup boot path reset-loops
	 * the core before main() — verified reproducible and independent of do_zero/pool
	 * size (so it is the boot-path call, not the pool zeroing), a layout-sensitivity
	 * of the FLASH+0x2000 vector region. extmem.c initialises the pool lazily on first
	 * extmem_malloc/calloc/realloc instead (application context, SDRAM long live). */
	memory_clear(&_extram_start, &_extram_end);
	external_psram_size = 64;                       /* soldered 64 MB SDRAM — no probe */

	/* C++ static constructors, then the application */
	__libc_init_array();
	main();

