newdigate/teensy-cores/imxrt1176/startup.c
	while (1) { __asm__ volatile("wfi"); }
}

/* ----------------------------------------------------------------------------
 * set_arm_clock_rt1176 — RT1176 CCM bring-up for a 996 MHz Cortex-M7 core.
 *
 * Faithful (but minimal) port of the EVKB SDK BOARD_BootClockRUN()
 *   (_boards/evkbmimxrt1170/.../clock_config.c) translated to direct register
 *   writes through imxrt1176.h. We bring up exactly the path Phase 0 needs:
 *     - confirm the 24 MHz crystal OSC is enabled/stable (PLL reference),
 *     - park the M7 core root on a safe slow source while the PLL re-locks,
 *     - configure + lock the ARM PLL (mirrors CLOCK_InitArmPll):
 *         Fout = Fin * (loopDivider / (2 * postDivider))
 *              = 24 MHz * (166 / (2*2)) = 996 MHz
 *       (loopDivider 166, postDivider kCLOCK_PllPostDiv2 == encoded 0),
 *     - route the ARM PLL to the M7 core CLOCK_ROOT (root 0, mux 4, div 1),
 *     - point the AHB/bus CLOCK_ROOT (root 2) at a safe source.
 *   GPIO/IOMUXC roots used by Phase 0 are left on their boot-ROM defaults
 *   (24 MHz OSC-derived); they are not on a CCM root that needs re-muxing for
 *   correctness here.
 *
 * QEMU caveat: QEMU's CCM is a clock-survival model — most of these writes are
 * absorbed and the CPU clock is wired to 996 MHz at the board level. Every
 * poll loop below is bounded (guard counters) so it cannot hang when a status
 * bit QEMU does not model never sets. On real silicon the loops spin until the
 * hardware reports OSC-stable / PLL-stable (hardware validation is Task 13).
 * -------------------------------------------------------------------------- */
void set_arm_clock_rt1176(void)
{
	volatile int i;

	/* --- 1. 24 MHz crystal OSC (ARM PLL reference) --------------------- */
	ANADIG_OSC_OSC_24M_CTRL |= ANADIG_OSC_OSC_24M_CTRL_OSC_EN |
	                           ANADIG_OSC_OSC_24M_CTRL_LP_EN;
	for (i = 0; i < 100000 &&
	     !(ANADIG_OSC_OSC_24M_CTRL & ANADIG_OSC_OSC_24M_CTRL_OSC_24M_STABLE); i++) {
		/* bounded wait for OSC stable */
	}

	/* --- 2. Park M7 core root on a slow source during PLL re-lock ------ */
	/* CLOCK_SetRootClock(kCLOCK_Root_M7, mux=OscRc48MDiv2(0), div=1) */
	CCM_CLOCK_ROOT0_CONTROL = CCM_CLOCK_ROOT_CONTROL_MUX(0) |
	                          CCM_CLOCK_ROOT_CONTROL_DIV(0);
	__asm__ volatile("dsb":::"memory");
	__asm__ volatile("isb":::"memory");

	/* --- 3. ARM PLL -> 996 MHz (mirrors CLOCK_InitArmPll) -------------- */
	{
		uint32_t reg = ANADIG_PLL_ARM_PLL_CTRL;

		/* Power the PLL down before reconfiguring (clear POWERUP/ENABLE,
		 * set GATE) so the loop/post dividers can change cleanly. */
		reg &= ~(ANADIG_PLL_ARM_PLL_CTRL_POWERUP |
		         ANADIG_PLL_ARM_PLL_CTRL_ENABLE_CLK |
		         ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_STABLE);
		reg |= ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_GATE;
		ANADIG_PLL_ARM_PLL_CTRL = reg;

		/* Program dividers, power up, hold ring off, keep gated for now. */
		reg &= ~(ANADIG_PLL_ARM_PLL_CTRL_DIV_SELECT(0xFF) |
		         ANADIG_PLL_ARM_PLL_CTRL_POST_DIV_SEL(0x3));
		reg |= ANADIG_PLL_ARM_PLL_CTRL_DIV_SELECT(166) |   /* loopDivider 166 */
		       ANADIG_PLL_ARM_PLL_CTRL_POST_DIV_SEL(0) |    /* PllPostDiv2 -> 996 MHz */
		       ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_GATE |
		       ANADIG_PLL_ARM_PLL_CTRL_POWERUP |
		       ANADIG_PLL_ARM_PLL_CTRL_HOLD_RING_OFF;
		ANADIG_PLL_ARM_PLL_CTRL = reg;
		__asm__ volatile("dsb":::"memory");
		__asm__ volatile("isb":::"memory");

		/* Settling delay (SDK waits ~30us); a short spin suffices here. */
		for (i = 0; i < 3000; i++) { /* ~PLL ramp */ }

		/* Release the hold-ring and wait (bounded) for PLL stable. */
		reg &= ~ANADIG_PLL_ARM_PLL_CTRL_HOLD_RING_OFF;
		ANADIG_PLL_ARM_PLL_CTRL = reg;
		for (i = 0; i < 100000 &&
		     !(ANADIG_PLL_ARM_PLL_CTRL & ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_STABLE); i++) {
			/* bounded wait for PLL stable */
		}

		/* Enable the clock output and ungate. */
		reg |= ANADIG_PLL_ARM_PLL_CTRL_ENABLE_CLK;
		reg &= ~ANADIG_PLL_ARM_PLL_CTRL_ARM_PLL_GATE;
		ANADIG_PLL_ARM_PLL_CTRL = reg;
		__asm__ volatile("dsb":::"memory");
		__asm__ volatile("isb":::"memory");
	}

	/* --- 4. Route ARM PLL to the M7 core CLOCK_ROOT (996 MHz) ---------- */
	/* CLOCK_SetRootClock(kCLOCK_Root_M7, mux=MuxArmPllOut(4), div=1) */
	CCM_CLOCK_ROOT0_CONTROL = CCM_CLOCK_ROOT_CONTROL_MUX(4) |
	                          CCM_CLOCK_ROOT_CONTROL_DIV(0);
	__asm__ volatile("dsb":::"memory");
	__asm__ volatile("isb":::"memory");

	/* --- 5. AHB/bus CLOCK_ROOT — SYS_PLL3_OUT/2 = 240 MHz -------------- */
	/* BUS_CLK_ROOT (CLOCK_ROOT2) is the LCDIFv2 data-fetch clock (b_clk /
	 * apb_clk, RM 48.3.3 + AN12940 §3.3: "higher b_clk ... avoids FIFO
	 * under-run"), and the ipg_clk of the AHB peripheral bus generally.  It
	 * used to be left on the boot-ROM-safe OSC/2 source (24 MHz); that starves
	 * the LCDIFv2 scanout on silicon (RPi-7" display: persistent output-FIFO
	 * underrun, HW-verified cleared by raising it).
	 *
	 * This now matches NXP's own BOARD_BootClockRUN exactly:
	 * SYS_PLL3_OUT / 2 = 240 MHz (mcuxsdk _boards/evkbmimxrt1170/
	 * project_template/clock_config.c: kCLOCK_BUS_ClockRoot_MuxSysPll3Out = 4,
	 * .div = 2 -- and CLOCK_SetRootClock() writes DIV field = div-1, so the
	 * field value here is 1).  240 MHz is wanted because the RK055HDMIPI4MA0
	 * panel (720x1280 RGB565 @ 58.7 Hz) needs ~108 MB/s of sustained scanout,
	 * 2.4x what the 800x480 RPi panel needed.
	 *
	 * ★ An earlier revision of this comment claimed SYS_PLL3 is "left BYPASSED
	 * on this board's boot", citing CTRL bit0 = 1, and used SYS_PLL2_OUT/3 =
	 * 176 MHz instead.  That was a MISREAD OF THE WRONG BIT.  Per
	 * mcuxsdk devices/RT/RT1170/periph/PERI_ANADIG_PLL.h, SYS_PLL3_CTRL has NO
	 * field at bit 0 -- BYPASS is bit 16.  The OV5640 camera bring-up read
	 * SYS_PLL3_CTRL @ 0x40C84210 = 0x2020201B on this board at boot, in which
	 * bit 16 is 0 and bit 29 (STABLE) is 1: SysPll3 is LOCKED at 480 MHz before
	 * any firmware runs.  The same misread was baked into the guard below,
	 * which tested bit 0 as BYPASS and only worked because SYS_PLL2_CTRL bit 0
	 * happens to read 0.  Both are corrected here.
	 *
	 * Guarded three-deep so a boot that leaves a PLL down degrades instead of
	 * leaving the AHB bus dead:
	 *     SYS_PLL3_OUT / 2 = 240 MHz   preferred; NXP's value
	 *     SYS_PLL2_OUT / 3 = 176 MHz   previous value; PLL2 feeds SEMC via PFD1
	 *     OSC / 2          =  24 MHz   the old safe-slow source
	 * A PLL counts as usable when it is stable, not gated and not bypassed.
	 * SYS_PLL3_CTRL @ ANADIG 0x40C84210, SYS_PLL2_CTRL @ 0x40C84240; both use
	 * STABLE bit29, GATE bit30, BYPASS bit16 (PERI_ANADIG_PLL.h). */
	{
		volatile uint32_t *const sys_pll3_ctrl =
		    (volatile uint32_t *)0x40C84210u;
		volatile uint32_t *const sys_pll2_ctrl =
		    (volatile uint32_t *)0x40C84240u;
		const uint32_t GATE   = (1u << 30);
		const uint32_t STABLE = (1u << 29);
		const uint32_t BYPASS = (1u << 16);
		const uint32_t p3 = *sys_pll3_ctrl;
		const uint32_t p2 = *sys_pll2_ctrl;
		if (!(p3 & GATE) && !(p3 & BYPASS) && (p3 & STABLE)) {
			/* mux 4 = SYS_PLL3_OUT, DIV field 1 = divide-by-2 -> 240 MHz. */
			CCM_CLOCK_ROOT2_CONTROL = CCM_CLOCK_ROOT_CONTROL_MUX(4) |
			                          CCM_CLOCK_ROOT_CONTROL_DIV(1);
		} else if (!(p2 & GATE) && !(p2 & BYPASS) && (p2 & STABLE)) {
			/* mux 6 = SYS_PLL2_OUT, DIV field 2 = divide-by-3 -> 176 MHz. */
			CCM_CLOCK_ROOT2_CONTROL = CCM_CLOCK_ROOT_CONTROL_MUX(6) |
			                          CCM_CLOCK_ROOT_CONTROL_DIV(2);
		} else {
			/* Fallback: OSC/2 (mux 0, div 1) — the old safe-slow source. */
			CCM_CLOCK_ROOT2_CONTROL = CCM_CLOCK_ROOT_CONTROL_MUX(0) |
			                          CCM_CLOCK_ROOT_CONTROL_DIV(0);
		}
	}
	__asm__ volatile("dsb":::"memory");
	__asm__ volatile("isb":::"memory");

	SystemCoreClock = 996000000u;
}

/* ----------------------------------------------------------------------------
 * systick_init — 1 kHz SysTick from the (now 996 MHz) core clock, plus the DWT
 * cycle counter (used by the Teensy cycle-accurate delay primitives).
 * -------------------------------------------------------------------------- */
void systick_init(void)
{
	SYST_RVR = (996000000u / 1000u) - 1u;   /* 1 ms reload @ 996 MHz */
	SYST_CVR = 0;
	SYST_CSR = 7;                            /* ENABLE | TICKINT | CLKSOURCE */

	/* DWT cycle counter for sub-microsecond timing. */
	ARM_DEMCR |= ARM_DEMCR_TRCENA;
	ARM_DWT_CTRL |= 1u;                      /* CYCCNTENA */
}

/* ----------------------------------------------------------------------------
 * systick_isr — 1 kHz tick. Increments the millisecond counter that delay.c
 * (Task 10) exposes via millis(). Kept in flash with the rest of startup.
 * -------------------------------------------------------------------------- */
void systick_isr(void)
{
	systick_millis_count++;
}

/* ----------------------------------------------------------------------------
 * Default exception/interrupt handlers — spin so faults are observable.
 * -------------------------------------------------------------------------- */
__attribute__((section(".startup")))
static void fault_isr(void)
{
	while (1) { /* hang */ }
}

__attribute__((section(".startup")))
static void unused_isr(void)
{
	while (1) { /* hang */ }
}

/* ----------------------------------------------------------------------------
 * Minimal memory copy / clear (kept in .startup, runs from flash before ITCM
 * is populated).
 * -------------------------------------------------------------------------- */
__attribute__((section(".startup"), noinline))
static void memory_copy(uint32_t *dest, const uint32_t *src, uint32_t *dest_end)
{
	if (dest == src) return;
	while (dest < dest_end) {
		*dest++ = *src++;
	}
}

__attribute__((section(".startup"), noinline))
static void memory_clear(uint32_t *dest, uint32_t *dest_end)
{
	while (dest < dest_end) {
		*dest++ = 0;
	}
}

/* ----------------------------------------------------------------------------
 * Weak stubs for teensy startup symbols that other (not-yet-ported) core files
 * may reference. Kept minimal — they do nothing. Real implementations arrive in
 * later phases.
 * -------------------------------------------------------------------------- */
__attribute__((weak)) void startup_early_hook(void) {}
__attribute__((weak)) void startup_middle_hook(void) {}
__attribute__((weak)) void startup_late_hook(void) {}
__attribute__((weak)) void unused_interrupt_vector(void) { while (1) {} }

