newdigate/teensy-cores/imxrt1176/startup.c
/* Install an ISR into the RAM vector table (external IRQs start at index 16). */
void attachInterruptVector(IRQ_NUMBER_t irq, void (*function)(void)) {
	_VectorsRam[16 + (int)irq] = function;
	__asm__ volatile("dsb":::"memory"); __asm__ volatile("isb":::"memory");
}

/* __libc_init_array() walks .init_array then calls _init(); we don't use the
 * .init/.fini crt objects, so provide empty stubs. */
__attribute__((weak)) void _init(void) {}
__attribute__((weak)) void _fini(void) {}

/* ----------------------------------------------------------------------------
 * Minimal newlib syscall stubs (kept in this file with the entry point so the
 * linker does not discard them).
 * -------------------------------------------------------------------------- */
#include <errno.h>
#include <sys/stat.h>

extern uint32_t _heap_start;
extern uint32_t _heap_end;
char *__brkval = (char *)&_heap_start;

__attribute__((weak))
void * _sbrk(int incr)
{
	char *prev = __brkval;
	if (incr != 0) {
		if (prev + incr > (char *)&_heap_end) {
			errno = ENOMEM;
			return (void *)-1;
		}
		__brkval = prev + incr;
	}
	return prev;
}

__attribute__((weak))
int _read(int file __attribute__((unused)), char *ptr __attribute__((unused)), int len __attribute__((unused)))
{
	return 0;
}

__attribute__((weak))
int _write(int file __attribute__((unused)), char *ptr __attribute__((unused)), int len)
{
	return len;
}

__attribute__((weak))
int _close(int fd __attribute__((unused)))
{
	return -1;
}

__attribute__((weak))
int _fstat(int fd __attribute__((unused)), struct stat *st)
{
	st->st_mode = S_IFCHR;
	return 0;
}

__attribute__((weak))
int _isatty(int fd __attribute__((unused)))
{
	return 1;
}

__attribute__((weak))
int _lseek(int fd __attribute__((unused)), long long offset __attribute__((unused)), int whence __attribute__((unused)))
{
	return -1;
}

__attribute__((weak))
void _exit(int status __attribute__((unused)))
{
	while (1) { __asm__ volatile("wfi"); }
}

__attribute__((weak))
void __cxa_pure_virtual(void)
{
	while (1) { __asm__ volatile("wfi"); }
}

__attribute__((weak))
int __cxa_guard_acquire(char *g)
{
	return !(*g);
}

__attribute__((weak))
void __cxa_guard_release(char *g)
{
	*g = 1;
}

__attribute__((weak))
void abort(void)
{
	while (1) { __asm__ volatile("wfi"); }
}
